/**
 * 
HP回復	HPを5秒毎にSKILL値×50[回復/減少]	ゼリッピ(+1),ゼリーキング(+2),グレートハゼ(+3),バンデージヴァンプ(-2)
MP回復	MPを5秒毎にSKILL値×25[回復/減少]	トゥートゥー(+1),グランドラルヴァ(+2),スノーピカ(+3),武闘虎(-3)
SP回復	SPを5秒毎にSKILL値×100[回復/減少]	トト(+1),ハートベア(+2),武闘虎(+3),マグマバブル(-3)
HP吸収	攻撃時、一定確率でHPを与えたダメージ×SKILL値×2%[回復] 上限750	ミネ(+1),バンデージヴァンプ(+2),ムスケル(+3)
MP吸収	攻撃時、一定確率でMPを与えたダメージ×SKILL値×2%[回復] 上限300	プニック(+1),アレネ(+2),エンピニオン(+3)
SP吸収	攻撃時、一定確率でSPを与えたダメージ×SKILL値×2%[回復/減少] 上限360	きのこ芋虫(+1),ハニーベア(+2),ポーウン(+3),ハスキー(-3)
自己再生	ダメージを受ける度に一定確率でHPがSKILL値×100[回復/減少]	スモールマトリョーシカ(+1),パピィルーム(+2),ハスキー(+3),パンプキン(-3),ブルームバンブー(-3)
緊急回避	HPが0になる攻撃を一定確率で回避。
属性UP[火]	属性値がSKILL値×10[増加/減少]	フラワーゼリッピ(+1),ピケル(+2),マグマバブル(+3),ムスケル(+3),フレイムリザード(+3),スリーピーマン(-1),森の精霊(-1),ハニービー(-1),葉っぱマン(-1),ウィングクリスタル(-1),ホースビー(-1),カニボレ(-1),ウィンキィ(-1),パピィルーム(-2),バクマンジュウ(-2),ゴムバブル(-2),モス(-2),プラバ(-2),ラバプライア(-2),パンプキン(-3),クリセラ(-3),ブルームバンブー(-3)
属性UP[水]	ハゼ(+1),クラーケンジュニア(+1),プニック(+1),武士ハゼ(+2),ピティーチャップ(+2),イジワル(+2),シャピアー(+2),ボクサーハゼ(+2),バイキングハゼ(+2),サザエキャップ(+2),アイスゼリッピ(+3),クレム(+3),イグルージャム(+3),グレートハゼ(+3),エンピニオン(+3),フラワーゼリッピ(-1),ピケル(-2),マグマバブル(-3),ムスケル(-3)
属性UP[風]	ハニービー(+1),ウィングクリスタル(+1),ホースビー(+1),ウィンキィ(+1),モス(+2),ラバプライア(+2),クリセラ(+3),ポイズンゼリッピ(-2),ポイズンリーフゼリッピ(-2),ストーンゴーレムジュニア(-2)
属性UP[土]	スリーピーマン(+1),葉っぱマン(+1),カニボレ(+1),ポイズンゼリッピ(+2),パピィルーム(+2),ポイズンリーフゼリッピ(+2),バクマンジュウ(+2),プラバ(+2),ストーンゴーレムジュニア(+2),パンプキン(+3),ブルームバンブー(+3),ゼリッピ(-1),リーフゼリッピ(-1),サイモン(-2),アジダハカ(-3),真アジダハカ(-3)
属性UP[雷]	ゼリッピ(+1),リーフゼリッピ(+1),サイモン(+2),アジダハカ(+3),真アジダハカ(+3),ハゼ(-1),ゼリッピリ(-1),クラーケンジュニア(-1),プニック(-1),武士ハゼ(-2),ピティーチャップ(-2),イジワル(-2),シャピアー(-2),ボクサーハゼ(-2),バイキングハゼ(-2),サザエキャップ(-2),アイスゼリッピ(-3),巫女ハゼ(-3),クレム(-3),イグルージャム(-3),グレートハゼ(-3),エンピニオン(-3)
属性UP[白]	森の精霊(+1),クレミノ(+1),ユニビ(+2),クレミノタトゥー(+2),トゥートゥークイーン(+3),ベービング(-1),クルーエルベービング(-1)スカルウォーリア(-1),ドグサ(-1),シクル(-2),バンデージヴァンプ(-2),グランドラルヴァ(-2),デビルナイト(-3),ポーウン(-3)
属性UP[黒]	ベービング(+1),クルーエルベービング(+1),スカルウォーリア(+1),ドグサ(+1),シクル(+2),バンデージヴァンプ(+2),グランドラルヴァ(+2),デビルナイト(+3),ポーウン(+3),クレミノ(-1),ユニビ(-2),クレミノタトゥー(-2),巫女ハゼ(-3),トゥートゥークイーン(-3)
STAB増加	ステータスがSKILL値×2[上昇/減少]。	ウサギ剣士(+1),ハートベア(+2),ログルベグル(+3)
HACK増加	テディ(+1),シクル(+2),デビルナイト(+3)
INT増加	ワイズキャット(+1),クレミノタトゥー(+2),エンピニオン(+3),アイスゼリッピ(-3)
DEF増加	スコルピノ(+1),サザエキャップ(+2),クレム(+3),クリセラ(-3)
MR増加	きのこ芋虫(+1),ユニビ(+2),クリセラ(+3)
DEX増加	ステータスがSKILL値分[上昇/減少]。	ポイズンスコルピノ(+1),イジワル(+2),ハスキー(+3),サングラミネ(-2),クレム(-3),ハンド(-3)
AGI増加	ハニービー(+1),ミンクス(+2),武闘虎(+3),タトゥーベア(-3)
STAB成長	ステータス成長率(SS~F)がSKILL値×2上昇	スコルピノ(+1),シャピアー(+2),真アジダハカ(+3)
HACK成長	平原ダックウォーリア(+1),武士ハゼ(+2),スキア(+3)
INT成長	森の精霊(+1),トゥートゥーキング(+2),トゥートゥークイーン(+3)
DEF成長	コクーン(+1),ピティーチャップ(+2),イグルージャム(+3)
MR成長	コクーン(+1),ミラクル(+2),グレートハゼ(+3)
DEX成長	ステータス成長率(SS~F)がSKILL値分上昇	ベービング(+1),レッドミネ(+2),ハンド(+3)
AGI成長	ホースビー(+1),ボクサーハゼ(+2),アジダハカ(+3)
鋼の肌	物理攻撃の被ダメージ軽減率がSKILL値×3ポイント[上昇/減少]	ゼリッピリ(+1),ストーンゴーレムジュニア(+2),エンピニオン(+3),ログルベグル(-3)
魔法耐性	魔法攻撃の被ダメージ軽減率がSKILL値×3ポイント[上昇/減少]	ウィンキィ(+1),サイモン(+2),巫女ハゼ(+3),ポーウン(-3)
仁王立ち	5秒間動かなければ6秒間被ダメージ軽減率がSKILL値×2ポイント[上昇/減少]	スリーピーマン(+1),バクマンジュウ(+2),パンプキン(+3),怪物の木(+3),スキア(-3)
初速	マップ移動後、1分間移動速度がSKILL値×2[増加/減少]	トゥートゥー(+1),ゼリーキング(+2),アジダハカ(+3),河童(+3),デビルナイト(-3)
瞬足	移動速度がSKILL値分[増加/減少]	ドグサ(+1),ラバプライア(+2),スキア(+3),ラルヴァ(-1),エンピニオン(-3)
致命打	攻撃時に50%の確率でSKILL値×1秒間クリティカル率が大幅に上昇(100%?)。	ワイズキャット(+1),バクマンジュウ(+2),ハンド(+3)
追撃[火]	攻撃対象との属性差を1につき1%、最大でSKILL値×5%の追加ダメージが発生。
追撃[水]	ハゼ(+1),海岸ダックウォーリア(+2),アイスゼリッピ(+3)
追撃[風]	ホースビー(+1),ラバプライア(+2),スキア(+3)
追撃[土]	カニボレ(+1),ポイズンゼリッピ(+2),ブルームバンブー(+3)
追撃[雷]	リーフゼリッピ(+1),武士ハゼ(+2),真アジダハカ(+3)
追撃[白]	クレミノ(+1),クレミノタトゥー(+2),巫女ハゼ(+3),ユニシール(+3)
追撃[黒]	クルーエルベービング(+1),バンデージヴァンプ(+2),ポーウン(+3)
一心不乱	一定時間内に特定回数攻撃すると、約5秒間追加ダメージがSKILL値×1%[発生/減少]。
戦闘鼓舞	自身を中心とした座標40×40の範囲内にモンスター、他プレイヤーキャラ、NPC等が10体以上存在すると発動する。
夜行性	現実時間の18:00～6:00は追加ダメージがSKILL値×2%[発生/減少]	ワイルドキャット(+1),レッドミネ(+2),真アジダハカ(+3),アジダハカ(-3)
不意打ち	自分以外をターゲットに設定しているモンスターを背後から攻撃すると追加ダメージがSKILL値×5%[発生/減少]。
財力	100～1,000seed消費してSKILL値×3%の追加ダメージを発生。消費のタイミングは直前の消費から10秒以上経過した後の攻撃時。消費されるSEEDを所持していないと無効になる。	クルーエルベービング(+1),トゥートゥーキング(+2),トゥートゥークイーン(+3)
不死の力	アンデッド状態となり、SKILL値×5%の追加ダメージが発生。
生存本能	HPが30%未満になると、10秒間、追加ダメージがSKILL値×5%[発生/減少]。	ドグサ(+1),トルコトゥートゥー(+2),武闘虎(+3),スノーピカ(-3)
耐久の初撃	約5秒間攻撃しなければ、次に攻撃した時から約1秒間の攻撃にSKILL値×25%の追加ダメージが発生。
天の裁き	約5秒毎に周辺の敵1体にSKILL値×10000ダメージ(止めを刺すことはなく1残る。権利に影響しない)
旋風撃	単一対象スキル攻撃時に一定確率で周囲の敵にダメージが発生するが、発動時は攻撃力50％
スプラッシュ	攻撃時、1ヒットにつき5％?の確率で攻撃対象と周辺の敵にSKILL値×500ダメージが発生(止めを刺すことはなく1残る。権利に影響しない)	クラーケンジュニア(+1),海岸ダックウォーリア(+2),イグルージャム(+3)
周囲騒然	周りのモンスターの移動速度が増加。持続時間の増減	ウィングクリスタル(+1),モス(+2),スノーピカ(+3)
鈍足	一定確率で対象の移動速度を半減。	ラルヴァ(+1),アレネ(+2),アイスゼリッピ(+3)
痛恨の一撃	攻撃・補助時、一定確率で[攻撃対象のうち１体/自身]をスタン状態にする	ハリネズミ(+1),洞窟ダックウォーリア(+2),パンプキン(+3),ムスケル(-3)
女神の微笑	レアアイテムの取得確率がSKILL値×5%[増加/減少]。	ベービング(+1),トルコトゥートゥー(+2),スノーピカ(+3),ログルベグル(-3)
合成職人	アイテム合成の成功確率が[増加/減少]。	ビッグマトリョーシカ(+1),ポイズンリーフゼリッピ(+2),ハンド(+3),シャピアー(-2)
宝探し	1時間毎に特定のアイテムをランダムで獲得。
日々の恩恵	1日に1回特定のアイテムをランダムで取得。
経験値増加	キャラクターの取得経験値がSKILL値×3%増加	トゥートゥー(+1),ピティーチャップ(+2),ブルームバンブー(+3)
成長期	5分毎にキャラクターが経験値SKILL値×1500を獲得
観察	このスキルを持つモンスターカードは未装着でも経験値のSKILL値×10%を取得。	テディ(+1),ビックテディ(+2),イグルージャム(+3)
グロウス	カードレベルアップ時一定経験値を獲得した状態で開始。	プレタ(+1)
匠の技	このスキルを持つカードを合成に使用すると作成されたカードの初期ステータスがランダムでSKILL値分[上昇/減少]。
ドロー↑St	ランク、スキルレベル、DEX、レベル、等級に比例して上級カードを引く確率増加。	夜幻影(+1)
合成運↑Lv	材料カードのレベルに比例して上級カードを合成する確率増加。	ゴーレムコマンドー(+1)
合成運↑St	ランク、スキルレベル、DEX、レベル、等級に比例して上級カードを合成する確率増加。
合成運↑Rk	材料カードの等級に比例して上級カードを合成する確率増加。
合成運↑MB	カード保有記録数に応じて上級カードを合成する確率増加。	ウィッキド(+1)
 */

export const SKILL = {
    HP回復: 'HP回復',
    MP回復: 'MP回復',
    SP回復: 'SP回復',
    HP吸収: 'HP吸収',
    MP吸収: 'MP吸収',
    SP吸収: 'SP吸収',
    自己再生: '自己再生',
    緊急回避: '緊急回避',
    属性UP火: '属性UP[火]',
    属性UP水: '属性UP[水]',
    属性UP風: '属性UP[風]',
    属性UP土: '属性UP[土]',
    属性UP雷: '属性UP[雷]',
    属性UP白: '属性UP[白]',
    属性UP黒: '属性UP[黒]',
    STAB増加: 'STAB増加',
    HACK増加: 'HACK増加',
    INT増加: 'INT増加',
    DEF増加: 'DEF増加',
    MR増加: 'MR増加',
    DEX増加: 'DEX増加',
    AGI増加: 'AGI増加',
    STAB成長: 'STAB成長',
    HACK成長: 'HACK成長',
    INT成長: 'INT成長',
    DEF成長: 'DEF成長',
    MR成長: 'MR成長',
    DEX成長: 'DEX成長',
    AGI成長: 'AGI成長',
    鋼の肌: '鋼の肌',
    魔法耐性: '魔法耐性',
    仁王立ち: '仁王立ち',
    初速: '初速',
    瞬足: '瞬足',
    致命打: '致命打',
    追撃火: '追撃[火]',
    追撃水: '追撃[水]',
    追撃風: '追撃[風]',
    追撃土: '追撃[土]',
    追撃雷: '追撃[雷]',
    追撃白: '追撃[白]',
    追撃黒: '追撃[黒]',
    一心不乱: '一心不乱',
    戦闘鼓舞: '戦闘鼓舞',
    夜行性: '夜行性',
    不意打ち: '不意打ち',
    財力: '財力',
    不死の力: '不死の力',
    生存本能: '生存本能',
    耐久の初撃: '耐久の初撃',
    天の裁き: '天の裁き',
    旋風撃: '旋風撃',
    スプラッシュ: 'スプラッシュ',
    周囲騒然: '周囲騒然',
    鈍足: '鈍足',
    痛恨の一撃: '痛恨の一撃',
    女神の微笑: '女神の微笑',
    合成職人: '合成職人',
    宝探し: '宝探し',
    日々の恩恵: '日々の恩恵',
    経験値増加: '経験値増加',
    成長期: '成長期',
    観察: '観察',
    グロウス: 'グロウス',
    匠の技: '匠の技',
    ドローSt: 'ドロー↑St',
    合成運Lv: '合成運↑Lv',
    合成運St: '合成運↑St',
    合成運Rk: '合成運↑Rk',
    合成運MB: '合成運↑MB',
}

export const SKILL_ARRAY = [
    'HP回復',
    'MP回復',
    'SP回復',
    'HP吸収',
    'MP吸収',
    'SP吸収',
    '自己再生',
    '緊急回避',
    '属性UP[火]',
    '属性UP[水]',
    '属性UP[風]',
    '属性UP[土]',
    '属性UP[雷]',
    '属性UP[白]',
    '属性UP[黒]',
    'STAB増加',
    'HACK増加',
    'INT増加',
    'DEF増加',
    'MR増加',
    'DEX増加',
    'AGI増加',
    'STAB成長',
    'HACK成長',
    'INT成長',
    'DEF成長',
    'MR成長',
    'DEX成長',
    'AGI成長',
    '鋼の肌',
    '魔法耐性',
    '仁王立ち',
    '初速',
    '瞬足',
    '致命打',
    '追撃[火]',
    '追撃[水]',
    '追撃[風]',
    '追撃[土]',
    '追撃[雷]',
    '追撃[白]',
    '追撃[黒]',
    '一心不乱',
    '戦闘鼓舞',
    '夜行性',
    '不意打ち',
    '財力',
    '不死の力',
    '生存本能',
    '耐久の初撃',
    '天の裁き',
    '旋風撃',
    'スプラッシュ',
    '周囲騒然',
    '鈍足',
    '痛恨の一撃',
    '女神の微笑',
    '合成職人',
    '宝探し',
    '日々の恩恵',
    '経験値増加',
    '成長期',
    '観察',
    'グロウス',
    '匠の技',
    'ドロー↑St',
    '合成運↑Lv',
    '合成運↑St',
    '合成運↑Rk',
    '合成運↑MB',
]

//test用にスキルを間引く
export const SKILL_ARRAY_FORTEST1 = [
    'HP回復',
    'MP回復',
    'SP回復',
    'HP吸収',
    'MP吸収',
    'SP吸収',
    '自己再生',
    '緊急回避',
    '属性UP[火]',
    '属性UP[風]',
]

//test用にスキルを間引く
export const SKILL_ARRAY_FORTEST2 = [
    '属性UP[雷]',
    '属性UP[白]',
    '属性UP[黒]',
    'STAB増加',
    'HACK増加',
    'INT増加',
    'DEF増加',
    'MR増加',
    'DEX増加',
    'AGI増加',

]

//test用にスキルを間引く
export const SKILL_ARRAY_FORTEST3 = [
    'DEF成長',
    'MR成長',
    'DEX成長',
    'AGI成長',
    '鋼の肌',
    '魔法耐性',
    '仁王立ち',
    '初速',
    '瞬足',
    '致命打',

]

//test用にスキルを間引く
export const SKILL_ARRAY_FORTEST4 = [
    '追撃[風]',
    '追撃[土]',
    '追撃[雷]',
    '追撃[白]',
    '追撃[黒]',
    '一心不乱',
    '戦闘鼓舞',
    '夜行性',
    '不意打ち',
    '財力',

]

export const SKILL_ARRAY_FORTEST5 = [

    '鈍足',
    '痛恨の一撃',
    '女神の微笑',
    '合成職人',
    '宝探し',
    '日々の恩恵',
    '経験値増加',
    '成長期',
    '観察',
    '属性UP[水]',
]

export const SKILL_ARRAY_FORTEST6 = [
    '属性UP[土]',
    '旋風撃',
    'スプラッシュ',
    'STAB成長',
    'HACK成長',
    'INT成長',
    '周囲騒然',
    '追撃[火]',
    '追撃[水]',
    '合成運↑Rk',
]

export const SKILL_ARRAY_FORTEST7 = [
    '合成運↑MB',
    '不死の力',
    '生存本能',
    '耐久の初撃',
    '天の裁き',
    'グロウス',
    '匠の技',
    'ドロー↑St',
    '合成運↑Lv',
    '合成運↑St',
]